-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-04-29 12:51:26
-- 伺服器版本： 8.0.35
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `join_to_play`
--

-- --------------------------------------------------------

--
-- 資料表結構 `booking_escape`
--

CREATE TABLE `booking_escape` (
  `sid` int NOT NULL,
  `member_id` int DEFAULT NULL,
  `member_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `mobile` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `store_id` int DEFAULT NULL,
  `store_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `booking_date` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `booking_time` varchar(10) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `booking_hours` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `game_id` int DEFAULT NULL,
  `game_name` varchar(30) DEFAULT NULL,
  `player_count` int DEFAULT NULL,
  `remark` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 傾印資料表的資料 `booking_escape`
--

INSERT INTO `booking_escape` (`sid`, `member_id`, `member_name`, `mobile`, `store_id`, `store_name`, `booking_date`, `booking_time`, `booking_hours`, `game_id`, `game_name`, `player_count`, `remark`, `created_at`) VALUES
(1, 42, '', '', 1, '1798真人實境', '2024-05-07', '14:00:00', '1', 1, '失落的鑰匙', 4, '', '2024-05-01 09:00:00'),
(2, 13, '', '', 13, '幻境脫逃', '2024-03-03', '12:00:00', '1', 19, '遺忘研究', 4, '', '2024-02-26 04:30:00'),
(3, 51, '', '', 29, '比奇堡', '2024-05-27', '16:00:00', '1', 29, '逐夢門', 6, '', '2024-12-20 08:00:00'),
(4, 88, '', '', 29, '比奇堡', '2024-04-17', '16:00:00', '1', 1, '失落的鑰匙', 6, '', '2024-08-13 08:00:00'),
(5, 63, '', '', 29, '比奇堡', '2024-04-22', '16:00:00', '1', 1, '失落的鑰匙', 7, '', '2024-08-13 08:00:00'),
(6, 41, '', '', 16, '奇幻時空突破', '2024-02-19', '16:00:00', '1.5', 22, '魔幻迷宮', 7, '', '2024-01-13 01:42:00'),
(7, 54, '', '', 8, '奇幻密室', '2024-04-06', '16:00:00', '1.5', 8, '時光迷宮', 8, '', '2023-08-31 02:08:00'),
(8, 14, '', '', 18, '空間之謎逃', '2024-05-21', '12:00:00', '1.5', 24, '幽影密室', 5, '', '2024-05-15 04:30:00'),
(9, 29, '', '', 28, '冒險蠟像館', '2024-04-21', '10:00:00', '1', 28, '神秘遺跡', 12, '', '2023-07-14 21:21:00'),
(10, 12, '', '', 27, '恐懼研究室', '2024-04-04', '16:00:00', '1.5', 18, '迷失森林', 10, '', '2023-08-29 23:53:00'),
(11, 58, '', '', 27, '恐懼研究室', '2024-02-10', '14:00:00', '1.5', 27, '迷途孤城', 8, '', '2023-10-03 22:32:00'),
(12, 53, '', '', 17, '時間迷宮', '2024-03-04', '12:00:00', '1.5', 23, '末日廢墟', 5, '', '2023-09-28 04:30:00'),
(13, 10, '', '', 11, '真實謎城', '2024-04-04', '12:00:00', '1.5', 11, '懸疑迷霧', 4, '', '2023-09-28 04:30:00'),
(14, 43, '', '', 2, '逃生門', '2024-02-05', '16:00:00', '1.5', 2, '未知之門', 10, '', '2023-09-29 01:04:00'),
(15, 30, '', '', 2, '逃生門', '2024-04-22', '12:00:00', '1.5', 12, '維多利亞鬼屋', 5, '', '2023-08-25 04:30:00'),
(16, 63, '', '', 2, '逃生門', '2024-03-02', '14:00:00', '1', 13, '未來之城', 9, '', '2023-02-23 23:19:00'),
(17, 1, '', '', 2, '逃生門', '2024-04-22', '10:00:00', '1', 31, '古代秘寶', 2, '', '2024-08-01 17:40:00'),
(18, 26, '', '', 30, '麥當逃', '2024-04-19', '16:00:00', '1', 30, '時空幻境', 6, '', '2024-08-13 08:00:00'),
(19, 50, '', '', 9, '創意時空門', '2024-03-10', '18:00:00', '1', 9, '神秘星船', 6, '', '2023-03-04 10:00:00'),
(20, 37, '', '', 19, '超時密道', '2024-02-01', '10:00:00', '1', 25, '時光門', 8, '', '2024-12-26 02:12:00'),
(21, 48, '', '', 7, '超時脫逃', '2024-05-02', '18:00:00', '1', 7, '歷史遺跡', 4, '', '2023-05-25 10:00:00'),
(22, 9, '', '', 14, '超現實密室', '2024-03-24', '16:00:00', '1', 20, '迷霧神社', 7, '', '2023-02-18 09:30:00'),
(23, 23, '', '', 26, '解謎探案社', '2024-02-25', '10:00:00', '1', 26, '異界迷宮', 13, '', '2024-08-19 02:56:00'),
(24, 12, '', '', 26, '解謎探案社', '2024-04-07', '16:00:00', '1', 1, '失落的鑰匙', 4, '', '2024-08-13 08:00:00'),
(25, 45, '', '', 10, '解謎探索', '2024-03-04', '16:00:00', '1', 10, '絕望監獄', 7, '', '2023-01-29 09:30:00'),
(26, 1, '', '', 3, '夢境密室逃脫', '2024-04-22', '18:00:00', '1', 1, '幽靈船艦', 6, '', '2023-07-22 10:00:00'),
(27, 1, '王小明', '0912345678', 3, '夢境密室逃脫', '2024-04-29', '10:00', NULL, 3, '絕密深夜驚魂', 4, '', '2024-04-28 20:11:50'),
(28, 19, '', '', 4, '墨色幻境', '2024-02-26', '16:00:00', '1.5', 4, '古堡迷失', 5, '', '2023-05-24 20:17:00'),
(29, 21, '', '', 6, '謎之密境', '2024-05-27', '16:00:00', '1.5', 6, '末日之旅', 11, '', '2024-05-20 16:13:00'),
(30, 15, '', '', 6, '謎之密境', '2024-04-03', '12:00:00', '1', 15, '科幻太空艙', 4, '', '2023-07-27 20:40:00'),
(31, 34, '', '', 6, '謎之密境', '2024-03-10', '12:00:00', '1', 16, '絕密深夜驚魂', 4, '', '2023-02-04 00:01:00'),
(32, 49, '', '', 6, '謎之密境', '2024-05-14', '16:00:00', '1.5', 17, '暗夜危機', 3, '', '2024-05-07 17:23:00'),
(33, 64, '', '', 15, '謎樓逃脫', '2024-03-16', '12:00:00', '1', 21, '失控實驗', 8, '', '2023-03-09 17:26:00'),
(34, 7, '', '', 5, '魔法筆記逃脫', '2024-04-06', '14:00:00', '1', 5, '末日逃出', 13, '', '2023-05-30 20:17:00');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `booking_escape`
--
ALTER TABLE `booking_escape`
  ADD PRIMARY KEY (`sid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
