-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-04-24 05:51:38
-- 伺服器版本： 8.0.35
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `join_to_play`
--

-- --------------------------------------------------------

--
-- 資料表結構 `comments`
--

CREATE TABLE `comments` (
  `sid` int NOT NULL,
  `member_name` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `store_name` varchar(30) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `store_type` varchar(15) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `contents` varchar(200) NOT NULL,
  `rating` tinyint NOT NULL,
  `event_date` date NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 傾印資料表的資料 `comments`
--

INSERT INTO `comments` (`sid`, `member_name`, `store_name`, `store_type`, `contents`, `rating`, `event_date`, `created_at`) VALUES
(1, '教皇', '安捷尼桌遊', '桌遊', '還不錯哦', 5, '2020-09-13', '2020-09-19 08:46:09'),
(2, '月亮之星', '貓咪貓咪G3', '桌遊', '環境超棒，老闆人很好，CP值超高的一家桌遊店！', 5, '2020-03-26', '2020-04-01 02:22:10'),
(3, '雪納瑞', '桌遊地下城', '桌遊', '遊戲很多元，服務人員態度親切', 5, '2022-09-10', '2022-09-16 02:18:59'),
(4, 'Ava', 'LOST Taiwan密室逃脫', '密室逃脫', '工作人員態度很親切，解說詳細', 5, '2023-05-13', '2023-05-19 01:16:53'),
(5, '文森', '龍窟桌遊', '桌遊', '燈光美，氣氛佳，體驗感很棒~~', 5, '2021-07-14', '2021-07-20 11:04:02'),
(6, '多不利鄧', '藍色迴廊', '密室逃脫', '店員態度不好', 3, '2021-09-08', '2021-09-14 01:11:55'),
(7, '小傑', '4FunBase桃園狼人館', '密室逃脫', '適合小朋友跳來跳去玩耍', 5, '2023-01-24', '2023-01-29 16:52:50'),
(8, '繽紛之旅', '貓腳印', '桌遊', '好玩又便宜，老闆人很好~', 5, '2020-07-21', '2020-07-27 03:49:28'),
(9, '大黃', 'Rostart邏思起子', '密室逃脫', '環境乾淨、工作人員講解清晰！', 5, '2021-11-28', '2021-12-03 21:34:44'),
(10, '表妹', 'Palette 派樂地', '桌遊', '桌遊保養度不好，缺東缺西', 3, '2023-04-21', '2023-04-27 03:22:01'),
(11, '星夜精靈', 'FK工作室', '密室逃脫', '大家一起解謎超好玩～', 5, '2020-04-21', '2020-04-26 20:20:26'),
(12, '星星', 'SoGoods說故事', '密室逃脫', '遊玩空間大，好玩', 5, '2021-03-03', '2021-03-09 01:25:35'),
(13, '秋天', '貳家桌遊店', '桌遊', '遊戲樂趣，親切氛圍，適合聚會', 5, '2022-06-26', '2022-07-02 01:50:17'),
(14, '學者', '陽光桌遊世界', '桌遊', '老闆親切，場地大', 5, '2021-07-23', '2021-07-28 19:35:29'),
(15, '美夢成真', 'FunLock放樂工作室', '密室逃脫', '真的很有趣，下次還會來玩～', 5, '2020-05-07', '2020-05-13 11:40:11'),
(16, '梅森', '桌遊侍', '桌遊', '飲料不好喝', 3, '2022-09-23', '2022-09-28 23:26:01'),
(17, '小八', '時光森林', '桌遊', '跟老闆聊得很盡興，也很熱心教學', 5, '2021-08-19', '2021-08-25 09:34:07'),
(18, '阿翰', 'UMOOSE遊慕思桌遊', '桌遊', '很棒的桌遊店', 5, '2020-03-26', '2020-03-31 17:48:50'),
(19, 'Noah', 'AToMic 原子複合式桌遊店', '桌遊', '桌遊好玩 餐點還好', 4, '2020-06-12', '2020-06-18 03:50:15'),
(20, '星光小子', 'Grow Life 靠過來桌遊咖啡廳', '桌遊', '超有耐心，對兒童桌遊介紹也很專業。很棒！', 5, '2023-06-04', '2023-06-10 02:50:33'),
(21, 'Isabella', '神不在場遊戲工作室', '密室逃脫', '很燒腦跟消耗熱量！好玩', 5, '2020-10-10', '2020-10-16 02:31:29'),
(22, 'Jackson', '動桌遊', '桌遊', '環境不ok', 2, '2023-09-15', '2023-09-21 02:02:30'),
(23, '彩虹奇遇', 'Open開房間桌遊餐館', '桌遊', '店員熱情親切', 5, '2021-07-29', '2021-08-03 18:58:37'),
(24, '家家', 'The King Pork 頂級豬排', '密室逃脫', '準時到還需要等半小時', 3, '2022-03-26', '2022-04-01 02:53:29'),
(25, '君君', '桌遊糖果城', '桌遊', '店員人超好很細心講解遊戲，帶我們玩了很多款遊戲。', 5, '2022-09-28', '2022-10-04 03:37:54'),
(26, '魔術師', '漫果子桌遊', '桌遊', '多元選擇，熱忱招待，每次都愉快', 5, '2022-05-14', '2022-05-19 22:08:05'),
(27, '達利', '謎宇宙 Myverse', '密室逃脫', '服務好', 5, '2023-06-09', '2023-06-15 03:12:18'),
(28, 'Wendy', 'Escer異世客', '密室逃脫', 'cp值超高', 5, '2022-02-05', '2022-02-10 18:14:50'),
(29, '阿成', '許多門', '密室逃脫', '空間沒有很大但機關都非常用心', 5, '2020-01-17', '2020-01-23 07:40:13'),
(30, 'Tiffany', '桌遊老爹', '桌遊', '大推推推還送小禮物真棒抽卡超好玩', 5, '2021-11-17', '2021-11-23 05:57:10'),
(31, '哈士奇', '笨蛋工作室', '密室逃脫', '道具精心製作，環境空間優良', 5, '2020-10-05', '2020-10-10 20:26:03'),
(32, '小宇', '獵時者密室逃脫', '密室逃脫', '很有趣，推薦沒玩過的人可以試試', 5, '2020-07-23', '2020-07-28 16:07:13'),
(33, '阿夜', '奧特狐桌遊店', '桌遊', '價錢超級佛心啊', 5, '2022-10-13', '2022-10-19 03:32:20'),
(34, '小艾', '卡卡城', '桌遊', '老闆跟店員態度人超好大推又超便宜可以坐一整天！', 5, '2022-09-19', '2022-09-24 18:44:01'),
(35, 'Tina', 'DeRoot休閒空間', '桌遊', '這裡桌遊遊戲超多', 5, '2024-01-24', '2024-01-30 02:24:09'),
(36, 'Mia', '桌遊故事屋', '桌遊', '店員很親切 環境乾淨 推薦！', 5, '2021-11-08', '2021-11-13 20:52:58'),
(37, 'Emily', '芒果遊戲工作室', '密室逃脫', '環境整潔 店員友善 甚至有英文解說', 5, '2024-05-13', '2024-05-18 17:08:31'),
(38, '漫遊仙境', '漫果子桌遊主題餐廳', '桌遊', '店員態度愛理不理，不推。', 1, '2020-09-07', '2020-09-13 00:08:12'),
(39, '心靈之花', '大安殿益智遊戲館', '桌遊', '店內之空間採光佳，感受舒適，且位置方便', 5, '2023-09-10', '2023-09-16 01:37:43'),
(40, '青春悠揚', '廢青集散地-桌遊俱樂部', '桌遊', '非常推薦親子活動的好地方！', 5, '2021-10-20', '2021-10-25 19:48:55'),
(41, 'Aiden', '饗玩俱樂部', '桌遊', '座位空間有些狹窄', 4, '2021-06-12', '2021-06-18 02:19:46'),
(42, '知世', '夢桌遊', '桌遊', '便宜好玩的桌遊店', 5, '2020-06-17', '2020-06-23 01:27:21'),
(43, '詩意流轉', '桌遊盒子', '桌遊', 'CP值超高的唷', 5, '2021-11-25', '2021-11-30 16:19:24'),
(44, '梅川伊服', 'Miss GAME', '密室逃脫', '超級好玩 工作人員很熱心', 5, '2020-04-22', '2020-04-28 02:32:37'),
(45, 'Emma', '小桌弄·兒童桌遊', '桌遊', '在吃的方面份量有點小', 4, '2020-03-29', '2020-04-04 08:58:53'),
(46, '王哥', '有堅桌遊店', '桌遊', '知識豐富，活動多元，玩遍所有遊戲', 5, '2021-07-30', '2021-08-05 01:55:57');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `comments`
--
ALTER TABLE `comments`
  MODIFY `sid` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
