-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-04-29 12:07:07
-- 伺服器版本： 8.0.35
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `join_to_play`
--

-- --------------------------------------------------------

--
-- 資料表結構 `match_desk`
--

CREATE TABLE `match_desk` (
  `md_id` int NOT NULL,
  `match_name` varchar(255) DEFAULT '匿名桌遊揪團',
  `store_id` int NOT NULL,
  `store_type` varchar(10) NOT NULL DEFAULT 'desk',
  `booking_date` date NOT NULL,
  `booking_time` varchar(255) NOT NULL,
  `player_count` int NOT NULL,
  `current_count` int NOT NULL DEFAULT '1',
  `special_request` varchar(255) DEFAULT NULL,
  `md_status` int DEFAULT NULL COMMENT '揪團狀態: 1成團 0未成團 3過期',
  `confirmed` tinyint DEFAULT NULL COMMENT '沒有成團0或空值，會在兩周後自動刪除',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- 傾印資料表的資料 `match_desk`
--

INSERT INTO `match_desk` (`md_id`, `match_name`, `store_id`, `store_type`, `booking_date`, `booking_time`, `player_count`, `current_count`, `special_request`, `md_status`, `confirmed`, `created_at`, `updated_at`) VALUES
(1, '草帽海草團', 3, 'desk', '2024-04-30', '11:00-14:00', 7, 7, '素食', NULL, 1, '2024-04-13 08:28:35', '2024-04-29 11:49:59'),
(2, '匿名桌遊揪團', 4, 'desk', '2024-05-20', '14:00-17:00', 6, 3, NULL, NULL, NULL, '2024-04-13 08:28:35', '2024-04-13 08:28:35'),
(3, '想吃御飯團', 7, 'desk', '2024-05-08', '17:00-20:00', 8, 1, NULL, NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(4, '匿名桌遊揪團', 10, 'desk', '2024-05-12', '20:00-23:00', 8, 1, '可以攜伴參加', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(5, '鳩團', 22, 'desk', '2024-04-30', '23:00-02:00', 5, 4, '會說英語', NULL, NULL, '2024-04-13 10:28:35', '2024-04-29 11:28:27'),
(6, '米糰', 2, 'desk', '2024-05-08', '11:00-14:00', 6, 2, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:48:40'),
(7, '番薯團', 5, 'desk', '2024-05-08', '14:00-17:00', 9, 2, '', NULL, NULL, '2024-04-10 08:28:35', '2024-04-13 08:28:35'),
(8, '來玩吧', 6, 'desk', '2024-05-12', '17:00-20:00', 7, 2, '', NULL, NULL, '2024-04-12 08:28:35', '2024-04-13 08:28:35'),
(9, '加入我們', 11, 'desk', '2024-05-10', '20:00-23:00', 6, 3, '烏挪', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(10, '嗨嗨', 20, 'desk', '2024-05-20', '23:00-02:00', 8, 2, '', NULL, NULL, '2024-04-12 08:28:35', '2024-04-19 21:41:52'),
(11, '古代樂團', 15, 'desk', '2024-05-08', '11:00-14:00', 6, 1, '', NULL, NULL, '2024-04-11 08:28:35', '2024-04-19 21:41:52'),
(12, '快點進來', 12, 'desk', '2024-05-25', '14:00-17:00', 7, 1, '', NULL, NULL, '2024-04-14 08:28:35', '2024-04-19 21:41:52'),
(13, '拜託你來', 19, 'desk', '2024-05-29', '17:00-20:00', 8, 5, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-13 08:28:35'),
(14, '求求你來', 5, 'desk', '2024-05-30', '20:00-23:00', 9, 3, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(15, 'please鳩團', 1, 'desk', '2024-04-30', '23:00-02:00', 5, 2, '會說英語', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(16, '小米糰', 2, 'desk', '2024-05-08', '11:00-14:00', 6, 2, '', NULL, NULL, '2024-04-10 08:28:35', '2024-04-19 21:41:52'),
(17, '番薯團w', 15, 'desk', '2024-05-08', '14:00-17:00', 9, 1, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(18, '來玩吧', 7, 'desk', '2024-05-12', '17:00-20:00', 7, 2, '', NULL, NULL, '2024-04-03 08:28:35', '2024-04-13 08:28:35'),
(19, '加入我們', 11, 'desk', '2024-05-10', '20:00-23:00', 6, 2, '', NULL, NULL, '2024-04-08 08:28:35', '2024-04-19 21:41:52'),
(20, '嗨嗨嗨w', 21, 'desk', '2024-05-20', '23:00-02:00', 8, 2, '飲酒', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(21, '暴龍戰隊', 24, 'desk', '2024-05-08', '11:00-14:00', 6, 2, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-13 08:28:35'),
(22, '快點進來', 12, 'desk', '2024-05-25', '14:00-17:00', 7, 2, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-13 08:28:35'),
(23, '拜託你來', 16, 'desk', '2024-05-29', '17:00-20:00', 8, 3, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 21:41:52'),
(24, '求求你來', 28, 'desk', '2024-05-30', '20:00-23:00', 9, 1, '', NULL, NULL, '2024-04-10 08:28:36', '2024-04-19 21:41:52'),
(25, '斑鳩團', 17, 'desk', '2024-05-09', '23:00-02:00', 5, 2, '寧靜玩家', NULL, NULL, '2024-04-13 08:28:36', '2024-04-13 08:28:35'),
(26, '玄米糰', 8, 'desk', '2024-05-08', '11:00-14:00', 6, 3, '', NULL, NULL, '2024-04-03 08:28:36', '2024-04-13 08:28:35'),
(27, '番薯團wwq', 13, 'desk', '2024-05-08', '14:00-17:00', 9, 2, '', NULL, NULL, '2024-04-08 08:28:36', '2024-04-13 08:28:35'),
(28, '來玩吧', 7, 'desk', '2024-05-12', '17:00-20:00', 7, 1, '', NULL, NULL, '2024-04-13 08:28:36', '2024-04-19 21:41:52'),
(29, '加入我們', 11, 'desk', '2024-05-10', '20:00-23:00', 6, 4, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-29 10:30:23'),
(30, '嗨嗨', 30, 'desk', '2024-05-20', '23:00-02:00', 8, 3, '', NULL, NULL, '2024-04-13 08:28:35', '2024-04-19 22:03:12'),
(31, '匿名桌遊揪團', 6, 'desk', '2024-05-09', '14:00-17:00', 8, 2, NULL, NULL, NULL, '2024-04-15 15:55:14', '2024-04-19 21:49:42'),
(32, '匿名桌遊揪團', 18, 'desk', '2024-05-16', '11:00-14:00', 6, 1, NULL, NULL, NULL, '2024-04-15 15:57:00', '2024-04-29 10:30:23'),
(33, '柳丁汁', 2, 'desk', '2024-05-02', '23:00-02:00', 6, 1, '蘋果先不要', NULL, NULL, '2024-04-16 09:51:31', '2024-04-29 10:30:23'),
(34, 'USAluv', 1, 'desk', '2024-05-11', '20:00-23:00', 7, 1, '', NULL, NULL, '2024-04-16 23:27:00', '2024-04-29 10:30:23'),
(35, '兄弟你好香', 2, 'desk', '2024-05-15', '23:00-02:00', 6, 2, '', NULL, NULL, '2024-04-17 11:19:17', '2024-04-19 23:28:15'),
(38, '一起來玩吧', 9, 'desk', '2024-05-17', '14:00-17:00', 6, 2, NULL, NULL, NULL, '2024-04-17 13:22:07', '2024-04-29 10:30:23'),
(39, '我愛黎明', 3, 'desk', '2024-05-30', '17:00-20:00', 8, 4, '', NULL, NULL, '2024-04-17 13:38:28', '2024-04-29 10:30:23'),
(40, '楓之谷蓋喝剩', 19, 'desk', '2024-05-17', '14:00-17:00', 6, 6, NULL, NULL, 1, '2024-04-17 14:03:28', '2024-04-29 11:49:59'),
(41, '亞特蘭提斯', 3, 'desk', '2024-05-11', '20:00-23:00', 6, 6, '', NULL, 1, '2024-04-19 15:55:55', '2024-04-29 11:49:59'),
(42, '測試」', 3, 'desk', '2024-05-30', '14:00-17:00', 6, 3, '', NULL, NULL, '2024-04-19 23:33:23', '2024-04-29 11:26:31'),
(43, '團團圓圓', 3, 'desk', '2024-05-25', '20:00-23:00', 8, 2, '', NULL, NULL, '2024-04-20 09:52:06', '2024-04-29 10:30:23'),
(44, '想要玩狼人殺', 12, 'desk', '2024-05-08', '17:00-20:00', 8, 2, '', NULL, NULL, '2024-04-23 14:02:17', '2024-04-29 10:30:23'),
(45, '我想要喝牛奶', 9, 'desk', '2024-06-28', '20:00-23:00', 6, 2, '', NULL, NULL, '2024-04-25 15:18:34', '2024-04-29 10:30:23'),
(47, '西瓜棋', 24, 'desk', '2024-05-15', '20:00-23:00', 5, 5, '', NULL, 1, '2024-04-29 11:08:25', '2024-04-29 11:49:59');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `match_desk`
--
ALTER TABLE `match_desk`
  ADD PRIMARY KEY (`md_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `match_desk`
--
ALTER TABLE `match_desk`
  MODIFY `md_id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
