-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-04-24 15:21:13
-- 伺服器版本： 8.0.35
-- PHP 版本： 8.1.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `join_to_play`
--

-- --------------------------------------------------------

--
-- 資料表結構 `store_escape`
--

CREATE TABLE `store_escape` (
  `sid` int NOT NULL DEFAULT '0',
  `store_name` varchar(50) DEFAULT NULL,
  `store_address` varchar(100) NOT NULL,
  `business_hours` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `store_phone` varchar(20) DEFAULT NULL,
  `rating` decimal(2,1) DEFAULT NULL,
  `store_pic` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `store_logo` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `store_notice` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci NOT NULL,
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- 傾印資料表的資料 `store_escape`
--

INSERT INTO `store_escape` (`sid`, `store_name`, `store_address`, `business_hours`, `store_phone`, `rating`, `store_pic`, `store_logo`, `store_notice`, `created_at`, `updated_at`) VALUES
(1, '1798真人實境', '高雄市鹽埕區河西路103號B1', '11:00–22:00', '75321798', 5.0, 'escape_pic_1', 'escape_logo_1', '請提前預約密室逃脫體驗，以確保有足夠的空間供您和您的團隊。', '2024-02-02 08:45:23', '2024-02-02 08:45:23'),
(2, '逃生門', '高雄市苓雅區中華四路2號B1', '12:00–21:00', '75369979', 5.0, 'escape_pic_2', 'escape_logo_2', '請勿攜帶任何外部物品進入密室，以確保挑戰的公平性和安全性。', '2024-02-03 16:22:10', '2024-02-03 16:22:10'),
(3, '夢境密室逃脫', '高雄市三民區建國三路213號', '11:00–21:00', '0916415255', 4.5, 'escape_pic_3', 'escape_logo_3', '本店提供多個不同難度的密室逃脫挑戰，請選擇適合您團隊的挑戰難度。', '2024-01-30 10:36:45', '2024-01-30 10:36:45'),
(4, '墨色幻境', '高雄市新興區林森一路178號', '13:00–20:30', '0980939394', 4.5, 'escape_pic_4', 'escape_logo_4', '在挑戰過程中，請隨時保持清醒並密切關注您的團隊成員。', '2024-01-30 10:36:45', '2024-01-30 10:36:45'),
(5, '魔法筆記逃脫', '高雄市苓雅區中華四路2號B1', '12:00–21:00', '75369979', 5.0, 'escape_pic_5', 'escape_logo_5', '為了您的安全，請遵守密室內的所有規定和指示。', '2024-02-03 16:22:10', '2024-02-03 16:22:10'),
(6, '謎之密境', '高雄市苓雅區中華四路9號', '10:00-20:00', '0905367718', 5.0, 'escape_pic_6', 'escape_logo_6', '如有任何緊急情況，請立即向工作人員求助。', '2024-02-04 21:11:37', '2024-02-04 21:11:37'),
(7, '超時脫逃', '高雄市三民區建國三路213號', '11:00-21:00', '0916415255', 4.5, 'escape_pic_7', 'escape_logo_7', '挑戰過程中請不要強行打開或破壞任何裝置或道具。', '2024-01-30 10:36:45', '2024-01-30 10:36:45'),
(8, '奇幻密室', '台北市大安區敦化南路一段100號', '13:00-20:00', '0923456789', 3.5, 'escape_pic_8', 'escape_logo_8', '請避免在挑戰過程中使用手機或其他外部通訊工具，以免影響挑戰體驗。', '2024-02-07 14:07:53', '2024-02-07 14:07:53'),
(9, '創意時空門', '新北市板橋區文化路二段30巷5號', '13:00-23:00', '0987654321', 4.5, 'escape_pic_9', 'escape_logo_9', '挑戰結束後，請勿洩漏任何關於挑戰內容的信息，以保持挑戰的神秘性。', '2024-02-08 09:48:02', '2024-02-08 09:48:02'),
(10, '解謎探索', '台中市西區忠明南路123號', '13:00-21:00', '0945123786', 1.5, 'escape_pic_10', 'escape_logo_10', '請遵守遊戲規則並保持團隊合作，以提高挑戰成功的機會。', '2024-02-09 23:59:59', '2024-02-09 23:59:59'),
(11, '真實謎城', '高雄市前鎮區成功二路50號', '13:00-21:30', '0998765432', 4.5, 'escape_pic_11', 'escape_logo_11', '挑戰結束後，請勿將任何遊戲物品帶離密室，以便下一個團隊挑戰。', '2024-02-10 03:20:15', '2024-02-10 03:20:15'),
(12, '時間之門逃脫', '桃園市中壢區永福路三段80巷12號', '13:00-23:00', '0912345678', 3.0, 'escape_pic_12', 'escape_logo_12', '為了提供最佳的挑戰體驗，請勿攜帶飲食或飲料進入密室。', '2024-02-11 11:45:38', '2024-02-11 11:45:38'),
(13, '幻境脫逃', '台南市安南區海安路一段200號', '13:00-21:00', '0956789123', 4.0, 'escape_pic_13', 'escape_logo_13', '如有任何問題或建議，請隨時向工作人員反饋，我們將竭誠為您服務。', '2024-02-12 07:36:09', '2024-02-12 07:36:09'),
(14, '超現實密室', '彰化縣彰化市進德路56號', '10:00-21:00', '0978563412', 4.0, 'escape_pic_14', 'escape_logo_14', '請在挑戰前將手機關閉或靜音，以確保挑戰過程的專注度。', '2024-02-13 19:50:28', '2024-02-13 19:50:28'),
(15, '謎樓逃脫', '新竹市東區科學園區研發一路2號', '13:00-23:00', '0921345678', 4.7, 'escape_pic_15', 'escape_logo_15', '在挑戰過程中，請留意任何提示或線索，以幫助您解決難題。', '2024-02-14 16:15:07', '2024-02-14 16:15:07'),
(16, '奇幻時空突破', '嘉義市西區興業西路88號', '13:00-20:00', '0967812345', 1.5, 'escape_pic_16', 'escape_logo_16', '請確保您的團隊成員身心健康，並避免在密室中使用暴力行為。', '2024-02-15 01:27:46', '2024-02-15 01:27:46'),
(17, '時間迷宮', '宜蘭縣宜蘭市中山路二段45號', '12:00–23:00', '0932154678', 3.0, 'escape_pic_17', 'escape_logo_17', '請在挑戰前核對您的預約時間，並提前到達以完成登記和準備。', '2024-02-16 10:08:34', '2024-02-16 10:08:34'),
(18, '空間之謎逃', '南投縣南投市南崗路三段70號', '13:00-23:00', '0901234567', 4.5, 'escape_pic_18', 'escape_logo_18', '挑戰過程中請不要強行打開或破壞任何裝置或道具。', '2024-02-17 20:14:52', '2024-02-17 20:14:52'),
(19, '超時密道', '雲林縣斗六市大同路一段33號', '10:00-23:00', '0945678901', 2.5, 'escape_pic_19', 'escape_logo_19', '如有任何身體不適或情緒波動，請立即向工作人員求助。', '2024-02-18 13:42:30', '2024-02-18 13:42:30'),
(20, '謎幻迷途', '基隆市七堵區八德路一段99號', '13:00-21:00', '0987654321', 3.5, 'escape_pic_20', 'escape_logo_20', '請勿在密室中攜帶任何易燃、易爆或危險品，以確保挑戰的安全性。', '2024-02-20 22:31:18', '2024-02-20 22:31:18'),
(21, '時光迴廊逃脫', '屏東縣屏東市廣東路二段60號', '13:00-20:00', '0978901234', 4.5, 'escape_pic_21', 'escape_logo_21', '挑戰過程中，請勿將任何物品丟棄或擾亂挑戰場景，以免影響挑戰體驗。', '2024-02-11 11:45:38', '2024-02-11 11:45:38'),
(22, '境界解謎', '花蓮縣花蓮市中正路168號', '10:00-20:00', '0932165478', 2.5, 'escape_pic_22', 'escape_logo_22', '請在挑戰前仔細閱讀挑戰說明和注意事項，以免發生任何意外或誤解。', '2024-02-12 07:36:09', '2024-02-12 07:36:09'),
(23, '穿越小舖', '金門縣金城鎮中正路三段22號', '13:00-23:00', '0954321897', 4.5, 'escape_pic_23', 'escape_logo_23', '挑戰過程中，請保持冷靜和理性，避免因情緒激動而影響挑戰的進行。', '2024-02-14 16:15:07', '2024-02-14 16:15:07'),
(24, '時空裂縫', '連江縣南竿鄉復興村60號', '13:00-23:00', '0998765432', 4.5, 'escape_pic_24', 'escape_logo_24', '挑戰過程中，請密切注意您的周圍環境，以避免受傷或發生意外。', '2024-02-05 05:55:44', '2024-01-30 15:31:25'),
(25, '阿比阿弟', '桃園市龜山區復興一路10號', '13:00-23:00', '0912345678', 2.5, 'escape_pic_25', 'escape_logo_25', '如有任何問題或建議，請隨時向工作人員反饋，我們將竭誠為您服務。', '2024-02-06 18:29:19', '2024-02-06 18:29:19'),
(26, '解謎探案社', '台北市中正區忠孝東路一段123號', '09:00 - 21:00', '0912345678', 4.5, 'escape_pic_26', 'escape_logo_26', '請避免在密室內大聲喧嘩或嘈雜，以免影響其他團隊的挑戰體驗。', '2024-02-11 11:45:38', '2024-02-11 11:45:38'),
(27, '恐懼研究室', '新北市板橋區文化路456號', '10:00 - 22:00', '0987654321', 3.5, 'escape_pic_27', 'escape_logo_27', '挑戰過程中請不要強行打開或破壞任何裝置或道具。', '2024-02-12 07:36:09', '2024-02-12 07:36:09'),
(28, '冒險蠟像館', '高雄市苓雅區六合路789號', '11:00 - 21:30', '0945123786', 4.0, 'escape_pic_28', 'escape_logo_28', '請在挑戰結束後及時向工作人員反饋您的挑戰體驗和建議，以便我們不斷改進服務。', '2024-02-13 19:50:28', '2024-02-13 19:50:28'),
(29, '比奇堡', '桃園市桃園區中正路567號', '10:00 - 21:00', '0918765432', 4.5, 'escape_pic_29', 'escape_logo_29', '為了您的安全，請遵守密室內的所有規定和指示。', '2024-02-15 01:27:46', '2024-02-15 01:27:46'),
(30, '麥當逃', '台南市中西區南京路890號', '09:00 - 22:00', '0954321897', 5.0, 'escape_pic_30', 'escape_logo_30', '請在挑戰前仔細閱讀挑戰說明和注意事項，以免發生任何意外或誤解。', '2024-02-16 10:08:34', '2024-02-16 10:08:34');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `store_escape`
--
ALTER TABLE `store_escape`
  ADD PRIMARY KEY (`sid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
